OmarShaaban74/Voting_System/Atmega32_Reg_OS.h
/*
 * Atmega32_Reg_OS.h
 *
 *  Created on: Sep 29, 2023
 *      Author: omars
 */

#ifndef ATMEGA32_REG_OS_H_
#define ATMEGA32_REG_OS_H_

#include "Standerd_Types_OS.h"

#define SREG_REG (*(volatile uint8 *const) 0x005F)
#define SPH_REG  (*(volatile uint8 *const) 0x005E)
#define SPL_REG  (*(volatile uint8 *const) 0x005D)
#define OCR0_REG (*(volatile uint8 *const) 0x005C)
#define GICR_REG (*(volatile uint8 *const) 0x005B)
#define GIFR_REG (*(volatile uint8 *const) 0x005A)
#define TIMSK_REG (*(volatile uint8 *const) 0x0059)
#define TIFR_REG (*(volatile uint8 *const) 0x0058)
#define SPMCR_REG (*(volatile uint8 *const) 0x0057)
#define TWCR_REG (*(volatile uint8 *const) 0x0056)
#define MCUCR_REG (*(volatile uint8 *const) 0x0055)
#define MCUCSR_REG (*(volatile uint8 *const) 0x0054)
#define TCCR0_REG (*(volatile uint8 *const) 0x0053)
#define TCNT0_REG (*(volatile uint8 *const) 0x0052)
#define OSCCAL_REG (*(volatile uint8 *const) 0x0051)
#define OCDR_REG (*(volatile uint8 *const) 0x0051)
#define SFIOR_REG (*(volatile uint8 *const) 0x0050)
#define TCCR1A_REG (*(volatile uint8 *const) 0x004F)
#define TCCR1B_REG (*(volatile uint8 *const) 0x004E)
#define TCNT1H_REG (*(volatile uint8 *const) 0x004D)
#define TCNT1L_REG (*(volatile uint8 *const) 0x004C)
#define OCR1AH_REG (*(volatile uint8 *const) 0x004B)
#define OCR1AL_REG (*(volatile uint8 *const) 0x004A)
#define OCR1BH_REG (*(volatile uint8 *const) 0x0049)
#define OCR1BL_REG (*(volatile uint8 *const) 0x0048)
#define ICR1H_REG (*(volatile uint8 *const) 0x0047)
#define ICR1L_REG (*(volatile uint8 *const) 0x0046)
#define TCCR2_REG (*(volatile uint8 *const) 0x0045)
#define TCNT2_REG (*(volatile uint8 *const) 0x0044)
#define OCR2_REG (*(volatile uint8 *const) 0x0043)
#define ASSR_REG (*(volatile uint8 *const) 0x0042)
#define WDTCR_REG (*(volatile uint8 *const) 0x0041)
#define UBRRH_REG (*(volatile uint8 *const) 0x0040)
#define UCSRC_REG (*(volatile uint8 *const) 0x0040)
#define EEARH_REG (*(volatile uint8 *const) 0x003F)
#define EEARL_REG (*(volatile uint8 *const) 0x003E)
#define EEDR_REG (*(volatile uint8 *const) 0x003D)
#define EECR_REG (*(volatile uint8 *const) 0x003C)
#define PORTA_REG (*(volatile uint8 *const) 0x003B)
#define DDRA_REG (*(volatile uint8 *const) 0x003A)
#define PINA_REG (*(volatile uint8 *const) 0x0039)
#define PORTB_REG (*(volatile uint8 *const) 0x0038)
#define DDRB_REG (*(volatile uint8 *const) 0x0037)
#define PINB_REG (*(volatile uint8 *const) 0x0036)
#define PORTC_REG (*(volatile uint8 *const) 0x0035)
#define DDRC_REG (*(volatile uint8 *const) 0x0034)
#define PINC_REG (*(volatile uint8 *const) 0x0033)
#define PORTD_REG (*(volatile uint8 *const) 0x0032)
#define DDRD_REG (*(volatile uint8 *const) 0x0031)
#define PIND_REG (*(volatile uint8 *const) 0x0030)
#define SPDR_REG (*(volatile uint8 *const) 0x002F)
#define SPSR_REG (*(volatile uint8 *const) 0x002E)
#define SPCR_REG (*(volatile uint8 *const) 0x002D)
#define UDR_REG (*(volatile uint8 *const) 0x002C)
#define UCSRA_REG (*(volatile uint8 *const) 0x002B)
#define UCSRB_REG (*(volatile uint8 *const) 0x002A)
#define UBRRL_REG (*(volatile uint8 *const) 0x0029)
#define ACSR_REG (*(volatile uint8 *const) 0x0028)
#define ADMUX_REG (*(volatile uint8 *const) 0x0027)
#define ADCSRA_REG (*(volatile uint8 *const) 0x0026)
#define ADCH_REG (*(volatile uint8 *const) 0x0025)
#define ADCL_REG (*(volatile uint8 *const) 0x0024)
#define TWDR_REG (*(volatile uint8 *const) 0x0023)
#define TWAR_REG (*(volatile uint8 *const) 0x0022)
#define TWSR_REG (*(volatile uint8 *const) 0x0021)
#define TWBR_REG (*(volatile uint8 *const) 0x0020)

#endif /* ATMEGA32_REG_OS_H_ */
